{
  "posts": [
    {
      "id": 1,
      "title": "EPL(English Premier League)",
      "author": "Abnuto Samuels",
      "timedate": "03-07-2018 12:30pm",
      "content": "                                                Liverpool have finally reached an agreement with AS Roma that will see goalkeeper Alisson Becker move to Anfield for €75m, according to reports. The Brazil international has been one of the club's top transfer targets this summer and stories broke on Tuesday that Liverpool had submitted their first formal offer for the 25-year-old shot-stopper. The Reds were quick to deny that they had made a move for Alisson. However, talks between the two clubs are believed to have continued through the night and an agreement has since been reached over the high-profile transfer. Journalist Fabrizio Romano has revealed that the Liverpool's latest offer, which it is understood will be split between €65m upfront and an extra €10m being included through performance-based add-ons, has all but been accepted by the Giallorossi. The two clubs are now believed to be discussing how the payments will be made before an official announcement is made this summer, but Romano claims in the Guardian that Liverpool are already making arrangements for Alisson to complete his medical. The Brazil international, who kept Manchester City's Ederson out of Tite's World Cup squad, will sign a contract at Anfield worth roughly €5.5m per season. Reports from Brazilian outlet UOL claim that Alisson has already packed his bags and is just waiting for the all-clear from Roma before leaving to complete his medical. It had been suggested that Real Madrid were interested in signing Alisson ahead of the new campaign. However, Los Blancos now appear to have their sights set on Chelsea's Thibaut Courtois following his performances at the World Cup. As a result, the west London outfit also had their name thrown into the mix as the race for Alisson's signature heated up, but the Blues failed to declare their interest in the Brazilian goalkeeper, much to the disappointment of Roma, who were hoping that a bidding war would ensue.&nbsp;",
      "image": "/images/GettyImages_1001904056.1532034061.jpg"
    },
    {
      "id": 2,
      "title": "World Cup",
      "author": "Reece Dodgen",
      "timedate": "03-06-2018 15:59pm",
      "content": "Croatia coach, Zlatko Dalic, revealed that even if he coached teams like Brazil and Barcelona, managing Croatia will always remain his favourite job after leading them to their first ever World Cup final appearance. Dalic's Croatia exhibited unmatched grit and quality to reach the ​World Cup final. They could not quite overcome their final hurdle in France and ended up losing 4-2. Their immense determination was lauded all around the world and Dalic couldn't have been any more proud. Reflecting on Croatia's World Cup exploits, Dalic said in an emotional speech: I can be coach of Brazil or Barcelona but this will always be the favorite job, to lead the Croatian national team, he said, as quoted by Goal. There is still grief because we had to win the trophy. But if someone had offered me to be in the final before the World Cup, we'd all have taken it. The Croatians overcame the likes of Argentina, Russia, England and Denmark during their impressive run. Captain, Luka Modric, stood out with his performances and was chosen as the best player of the tournament. The Balkan outfit were greeted by an estimated half-a-million fans on the streets of Zagreb having returned home after a sensational run in Russia.",
      "image": "/images/modric_mbappe_trophy.jpg"
    },
    {
      "id": 3,
      "title": "Latest Transfer New",
      "author": "Aqueelah Taljaard",
      "timedate": "18-07-2018 10:00pm",
      "content": "Last season was pretty difficult for Jose Mourinho's Manchester United. They did not look at their best for the majority of the season and ended up finishing 19 points behind crosstown rivals, Manchester City. With the new season just three weeks away, United must gear themselves up for a brighter campaign and hopefully, a rewarding one. Here, we look at three things United must do to have a real shot at the title. Under Sir Alex Ferguson, Manchester United had a reputation for being one of the more aesthetic sides in the Premier League. Jose Mourinho is a lot more pragmatic in his approach and loves to do things a tad more cautiously. The problem does not lie with the way United play, it's with the lack of intensity they have. For large chunks of last season, they lacked the urgency we usually associate with them. They need to play like they have a point to prove and everything else will most like fall in line. Alexis Sanchez is one of the biggest names in the English Premier League. His performances with Arsenal earned him the recognition he deserved, but now, at an even more demanding club, his performances must do the talking. The player was unsure of his position on the field for a large chunk of the campaign and looked  clueless about his movement. The former Barcelona man bagged 24 goals in his best ever Premier League campaign and United would need him to produce something similar, next season. Paul Pogba probably was the most criticised player in the Manchester United squad last season. Despite what the critics would have you believe, he did manage some pretty convincing performances throughout the course of the season. Now, with a World Cup winner's medal dangling around his neck, he must show a little more authority for his club as well. Nemanja Matic's performances will also be crucial for United as the Frenchman would need to be relieved of defensive duties to play his natural. Mourinho must find a way to build a system that supports Paul Pogba. Everything else will fall into place. ",
      "image": "/images/Jose-Mourinho-GQ-2Aug17_rex_b.jpg"
    },
    {
      "id": 4,
      "title": "Man Utd News",
      "author": "Ridhaa Cupido",
      "timedate": "12-06-2018 14:45pm",
      "content": "Paul Pogba is eyeing a return to ​Juventus this summer, according to reports in Italy. The Frenchman has supposedly grown tired of ​Manchester United manager Jose Mourinho, and wants to return to Serie A now that ​Cristiano Ronaldo has made the move there. The back end of last season saw an apparent rift break out between Pogba and Mourinho, and ever since, the press have loved to speculate over the World Cup winner's future at the club. Though little noise has been made of Pogba's Old Trafford future in recent weeks, the latest headline claims that he's looking to move back to Turin, having been persuaded to return by the signing of Cristiano Ronaldo. In fact, ​Tuttosport go as far as dedicating an entire front page to the claim on Wednesday morning's paper. This is entirely based on the player's supposed unhappiness under Jose Mourinho, and a conversation that he had with Blaise Matuidi (of Juventus) after the World Cup final. This conversation, for some reason, has made a few pen pushers believe that the 25-year-old is determined to find his way back to Turin simply because his France teammate asked him to. Pogba simply replied to the question: Ah, the Old Lady, the Old Lady,which must be French for (yes) according to the Italians. It might be worth mentioning that it was Tuttosport that broke the news about Ronaldo's decision to move to Juventus a few weeks ago, but even a broken clock is right twice a day. Finally, another factor for Pogba is the supposed return of Zinedine Zidane. The Frenchman is expected to move back to Juventus and take up the role of Director of Sport in the coming months, and that excites the midfielder. Could this be the second time Tuttosport is right? Perhaps. Then again, perhaps not. It's one thing finding out information about a transfer, it's another to be able to climg inside a player's head and figure out where he sees his own future.",
      "image": "/images/705339-pogba-world-cup.jpg"
    },
    {
      "id": 5,
      "title": "La Liga",
      "author": "Miguel Jacobs",
      "timedate": "13-07-2018 00:00am",
      "content": "La Liga champions ​FC Barcelona are said to have agreed personal terms with Paris Saint-Germain's midfield starlet Adrien Rabiot according to multiple reports in the Spanish press, especially in Catalonia. El Mundo Deportivo stated last week that Barcelona's general manager and technical secretary Eric Abidal have already held a meeting with PSG officials over a potential deal to bring Rabiot to the Camp Nou. Diario Sport now reveal that the Blaugrana have agreed personal terms with Rabiot and are positive of PSG sanctioning a deal of around €40m for the Frenchman. Rabiot's contract at PSG expires next summer and Barcelona are therefore hopeful of sealing a deal for the player in this summer itself after scouting him for quite some time. A report in France Football earlier in July stated that ​Eric Abidal also met with the player's mother to discuss a potential deal and then Mundo Deportivo released an image of the Barcelona legend at the Paris airport. It was previously reported that PSG owner Nasser Al Khelaifi is reportedly still confident of a renewal for the 23-year-old, who was excluded from France’s World Cup squad this summer.",
      "image": "/images/650513922.jpg.0.jpg"
    },
    {
      "id": 6,
      "title": "Serie A",
      "author": "Wahhaaj Davids",
      "timedate": "16-07-2018 11:40am",
      "content": "Recent​ ​World Cup winner and ​Manchester United star Paul Pogba reportedly wants a return to his former club ​Juventus with it being understood that their new signing Cristiano Ronaldo could convince him to make the switch. According to the ​Express, the Frenchman has grown tired of life in Manchester and of the constant criticism aimed at him ever since he made the big money move to Old Trafford from Turin in 2016. Ronaldo's big money move could pave the way for a return as with the Portugese's arrival Juventus will automatically go into the UEFA Champions League as favourites. This could entice Pogba who would want to have a crack at winning the title, something which does not look feasible currently at United. Former Newcastle United goalkeeper Shaka Hislop believes that Pogba's exploits at Russia will be very beneficial for United, should he stay with the Red Devils. When things weren’t going right at Manchester United he fell out of love with the game. He saw here that you can be outside of your comfort zone and be more involved with the team but still enjoy it. If that’s what he gets from being a World Cup champion, Manchester United will benefit. Since moving to Old Trafford in 2016, Pogba has made 88 appearances in all competitions, scoring 15 goals and helping them win the 2016 Europa League title.",
      "image": "/images/w33432promo2947284w170.jpg"
    },
    {
      "id": 7,
      "title": "UEFA",
      "author": "Jarod Britz",
      "timedate": "09-07-2018 01:30am",
      "content": "​Napoli forward Lorenzo Insigne looks like he is gearing up for the arrival of Cristiano Ronaldo in the Serie A ​after completing his transfer from Real Madrid to Juventus this summer. Insigne believes that Ronaldo won't be able to win games for ​Juventus all by himself. The Bianconeri, who have now won seven continuous league titles came up with the swoop of the summer when they announced Ronaldo's arrival in Turin. The Portuguese hitman himself is looking for a new beginning in his glorious career. Insigne does believe that Ronaldo's arrival will be good for Serie A but believes that Juventus might slip up domestically as they aim to win the Champions League. Speaking about Ronaldo's arrival in Italy, Insigne told ​La Gazzetta dello Sport, CR7? Welcome to him, but I’m curious to see how he’ll adapt to our league. He won’t be able to win games by himself He continued, Personally I prefer Messi for what he represents for football, but the talent of the Portuguese is not in question. If he’s won five Ballons d’Or it means something. Italian defences are very strong though, even if he proved against Juventus that he’s a phenomenon. In a longer tournament we’ll see… Meanwhile Napoli will aim to pull up some big surprises next season under the leadership of seasoned coach Carlo Ancelotti.",
      "image": "/images/Desktop-Wallpaper-Cristiano-Ronaldo-Juventus.jpg"
    },
    {
      "title": "scdcc",
      "timedate": "12:00pm 12/08/2018",
      "content": "                        <p>dcvdsvsdfvfdsb</p>\r\n                    ",
      "id": 8,
      "author": "Devon Naaaidoo"
    },
    {
      "title": "nzn kjn ",
      "timedate": "knkc nkldnc",
      "content": "                        <p><span style=\"background-color: rgb(0, 255, 0);\">dc dcdcdsc</span></p>\r\n                    ",
      "id": 9,
      "author": ""
    }
  ]
}